#### `terraform plan` Success

<details><summary>Show Output</summary>

```diff

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
+ create
 <= read (data resources)

Terraform will perform the following actions:

  # data.external.kubeadm_join will be read during apply
  # (config refers to values not yet known)
 <= data "external" "kubeadm_join"  {
      + id      = (known after apply)
      + program = [
          + "./scripts/kubeadm-token.sh",
        ]
      + query   = {
          + "host" = (known after apply)
        }
      + result  = (known after apply)
    }

  # data.external.private_ipv4_gateway[0] will be read during apply
  # (config refers to values not yet known)
 <= data "external" "private_ipv4_gateway"  {
      + id      = (known after apply)
      + program = [
          + "./scripts/gateway.sh",
        ]
      + query   = {
          + "host" = (known after apply)
        }
      + result  = (known after apply)
    }

  # data.external.private_ipv4_gateway[1] will be read during apply
  # (config refers to values not yet known)
 <= data "external" "private_ipv4_gateway"  {
      + id      = (known after apply)
      + program = [
          + "./scripts/gateway.sh",
        ]
      + query   = {
          + "host" = (known after apply)
        }
      + result  = (known after apply)
    }

  # data.template_file.calico_metallb will be read during apply
  # (config refers to values not yet known)
 <= data "template_file" "calico_metallb"  {
      + id       = (known after apply)
      + rendered = (known after apply)
      + template = "apiVersion: projectcalico.org/v3\nkind: BGPConfiguration\nmetadata:\n  name: default\nspec:\n  logSeverityScreen: Info\n  nodeToNodeMeshEnabled: true\n  asNumber: 65000\n\n---\n\napiVersion: projectcalico.org/v3\nkind: BGPPeer\nmetadata:\n  name: metallb\nspec:\n  peerIP: 127.0.0.1\n  asNumber: 65480\n\n---\n\napiVersion: projectcalico.org/v3\nkind: IPPool\nmetadata:\n  name: metallb-packet-public\nspec:\n  cidr: ${cidr}\n  disabled: true\n"
      + vars     = {
          + "cidr" = (known after apply)
        }
    }

  # data.template_file.metallb_config will be read during apply
  # (config refers to values not yet known)
 <= data "template_file" "metallb_config"  {
      + id       = (known after apply)
      + rendered = (known after apply)
      + template = "apiVersion: v1\nkind: ConfigMap\nmetadata:\n  namespace: metallb-system\n  name: config\ndata:\n  config: |\n    peers:\n    - peer-address: 127.0.0.1\n      peer-asn: 65000\n      my-asn: 65480\n    address-pools:\n    - name: packet-public\n      protocol: bgp\n      addresses:\n      - ${cidr}\n"
      + vars     = {
          + "cidr" = (known after apply)
        }
    }

  # null_resource.calico_node_peers[0] will be created
+ resource "null_resource" "calico_node_peers" {
      + id = (known after apply)
    }

  # null_resource.calico_node_peers[1] will be created
+ resource "null_resource" "calico_node_peers" {
      + id = (known after apply)
    }

  # null_resource.setup_calico will be created
+ resource "null_resource" "setup_calico" {
      + id = (known after apply)
    }

  # null_resource.setup_calico_metallb will be created
+ resource "null_resource" "setup_calico_metallb" {
      + id = (known after apply)
    }

  # null_resource.setup_metallb will be created
+ resource "null_resource" "setup_metallb" {
      + id = (known after apply)
    }

  # null_resource.setup_worker[0] will be created
+ resource "null_resource" "setup_worker" {
      + id = (known after apply)
    }

  # null_resource.setup_worker[1] will be created
+ resource "null_resource" "setup_worker" {
      + id = (known after apply)
    }

  # packet_bgp_session.kube_bgp[0] will be created
+ resource "packet_bgp_session" "kube_bgp" {
      + address_family = "ipv4"
      + default_route  = false
      + device_id      = (known after apply)
      + id             = (known after apply)
      + status         = (known after apply)
    }

  # packet_bgp_session.kube_bgp[1] will be created
+ resource "packet_bgp_session" "kube_bgp" {
      + address_family = "ipv4"
      + default_route  = false
      + device_id      = (known after apply)
      + id             = (known after apply)
      + status         = (known after apply)
    }

  # packet_device.k8s_controller will be created
+ resource "packet_device" "k8s_controller" {
      + access_private_ipv4              = (known after apply)
      + access_public_ipv4               = (known after apply)
      + access_public_ipv6               = (known after apply)
      + always_pxe                       = false
      + billing_cycle                    = "hourly"
      + created                          = (known after apply)
      + deployed_facility                = (known after apply)
      + facilities                       = [
          + "ewr1",
        ]
      + hardware_reservation_id          = (known after apply)
      + hostname                         = "ewr1-controller"
      + id                               = (known after apply)
      + locked                           = (known after apply)
      + network                          = (known after apply)
      + operating_system                 = "ubuntu_16_04"
      + plan                             = "t1.small.x86"
      + ports                            = (known after apply)
      + project_id                       = (known after apply)
      + public_ipv4_subnet_size          = (known after apply)
      + root_password                    = (sensitive value)
      + ssh_key_ids                      = (known after apply)
      + state                            = (known after apply)
      + tags                             = [
          + "kubernetes",
          + "k8s",
          + "controller",
        ]
      + updated                          = (known after apply)
      + wait_for_reservation_deprovision = false
    }

  # packet_device.k8s_workers[0] will be created
+ resource "packet_device" "k8s_workers" {
      + access_private_ipv4              = (known after apply)
      + access_public_ipv4               = (known after apply)
      + access_public_ipv6               = (known after apply)
      + always_pxe                       = false
      + billing_cycle                    = "hourly"
      + created                          = (known after apply)
      + deployed_facility                = (known after apply)
      + facilities                       = [
          + "ewr1",
        ]
      + hardware_reservation_id          = (known after apply)
      + hostname                         = "ewr1-worker-0"
      + id                               = (known after apply)
      + locked                           = (known after apply)
      + network                          = (known after apply)
      + operating_system                 = "ubuntu_16_04"
      + plan                             = "t1.small.x86"
      + ports                            = (known after apply)
      + project_id                       = (known after apply)
      + public_ipv4_subnet_size          = (known after apply)
      + root_password                    = (sensitive value)
      + ssh_key_ids                      = (known after apply)
      + state                            = (known after apply)
      + tags                             = [
          + "kubernetes",
          + "k8s",
          + "worker",
        ]
      + updated                          = (known after apply)
      + wait_for_reservation_deprovision = false
    }

  # packet_device.k8s_workers[1] will be created
+ resource "packet_device" "k8s_workers" {
      + access_private_ipv4              = (known after apply)
      + access_public_ipv4               = (known after apply)
      + access_public_ipv6               = (known after apply)
      + always_pxe                       = false
      + billing_cycle                    = "hourly"
      + created                          = (known after apply)
      + deployed_facility                = (known after apply)
      + facilities                       = [
          + "ewr1",
        ]
      + hardware_reservation_id          = (known after apply)
      + hostname                         = "ewr1-worker-1"
      + id                               = (known after apply)
      + locked                           = (known after apply)
      + network                          = (known after apply)
      + operating_system                 = "ubuntu_16_04"
      + plan                             = "t1.small.x86"
      + ports                            = (known after apply)
      + project_id                       = (known after apply)
      + public_ipv4_subnet_size          = (known after apply)
      + root_password                    = (sensitive value)
      + ssh_key_ids                      = (known after apply)
      + state                            = (known after apply)
      + tags                             = [
          + "kubernetes",
          + "k8s",
          + "worker",
        ]
      + updated                          = (known after apply)
      + wait_for_reservation_deprovision = false
    }

  # packet_project.kubenet will be created
+ resource "packet_project" "kubenet" {
      + backend_transfer  = false
      + created           = (known after apply)
      + id                = (known after apply)
      + name              = "k8s-bgp"
      + organization_id   = (known after apply)
      + payment_method_id = (known after apply)
      + updated           = (known after apply)

      + bgp_config {
          + asn             = 65000
          + deployment_type = "local"
          + max_prefix      = (known after apply)
          + status          = (known after apply)
        }
    }

  # packet_reserved_ip_block.load_balancer_ips will be created
+ resource "packet_reserved_ip_block" "load_balancer_ips" {
      + address        = (known after apply)
      + address_family = (known after apply)
      + cidr           = (known after apply)
      + cidr_notation  = (known after apply)
      + facility       = "ewr1"
      + gateway        = (known after apply)
      + global         = (known after apply)
      + id             = (known after apply)
      + manageable     = (known after apply)
      + management     = (known after apply)
      + netmask        = (known after apply)
      + network        = (known after apply)
      + project_id     = (known after apply)
      + public         = (known after apply)
      + quantity       = 2
      + type           = "public_ipv4"
    }

Plan: 14 to add, 0 to change, 0 to destroy.
```

</details>

*Workflow: `Terraform Check`, Action: `hashicorpterraform-github-actions3`*